
const Candidates = [
    {
        industiry: {
            id: 1,
            name: 'it-техонологии'
        },
        proffession: {
            id: 1,
            name: 'Программист'
        },
        personalQualities: [
            {
                id: 25,
                name: 'Дисциплинированность'
            },
            {
                id: 26,
                name: 'Жадность'
            },
            {
                id: 5,            
                name: 'Исполнительность'
            },
            {
                id: 2,            
                name: 'Коммуникабельность'
            }
        ],
        professionalQualities: [
            {
                id: 1,
                name: 'Базы данных',
            },
            {
                id: 2,
                name: 'Английский язык'
            },
        ],
        skills: [
            {
                id: 1,
                name: 'C++'
            },
            {
                id: 2,
                name: '1C'
            },
            {
                id: 3,
                name: 'Алгоритмы сортировки'
            },
            {
                id: 4,
                name: 'Блокчейн '
            },
            {
                id: 5,
                name: 'Модульное тестирование'
            }
        ]
    },
    {
        industiry: {
            id: 1,
            name: 'it-техонологии'
        },
        proffession: {
            id: 1,
            name: 'Программист'
        },
        personalQualities: [
            {
                id: 25,
                name: 'Дисциплинированность'
            },

            {
                id: 2,            
                name: 'Коммуникабельность'
            }
        ],
        professionalQualities: [
            {
                id: 1,
                name: 'Базы данных',
            },

        ],
        skills: [
            {
                id: 4,
                name: 'Блокчейн '
            },
            {
                id: 5,
                name: 'Модульное тестирование'
            }
        ]
    }
    

   
]

const filtersCandidate = {
    industriy: [
        {
            id: 1,
            name: 'it-технологии',
            skills: [
                {
                    id: 1,
                    name: 'C++'
                },
                {
                    id: 2,
                    name: '1C'
                },
                {
                    id: 3,
                    name: 'Алгоритмы сортировки'
                },
                {
                    id: 4,
                    name: 'Блокчейн '
                },
                {
                    id: 5,
                    name: 'Модульное тестирование'
                },
                {
                    id: 6,
                    name: 'Облачные технологии'
                },
                {
                    id: 7,
                    name: 'Отладка программ'
                },
                {
                    id: 8,
                    name: 'HCL'
                },
                {
                    id: 9,
                    name: 'Java'
                },
                {
                    id: 10,
                    name: 'JavaScript'
                },
                {
                    id: 11,
                    name: 'Kotlin'
                },
                {
                    id: 12,
                    name: 'Lua'
                },
                {
                    id: 13,
                    name: 'MySQL'
                },
                {
                    id: 14,
                    name: 'Oracle'
                },
                {
                    id: 15,
                    name: 'PHP'
                },
                {
                    id: 16,
                    name: 'Phython'
                },
                {
                    id: 17,
                    name: 'UX-дизайн'
                }
    
            ],
            professionalQualities: [
                {
                    id: 1,
                    name: 'Базы данных'
                },
                {
                    id: 2,
                    name: 'Библиотеки'
                },
                {
                    id: 3,
                    name: 'Знание нескольких языков программирования'
                },
                {
                    id: 4,
                    name: 'Понятный код'
                },
                {
                    id: 5,
                    name: 'Структура данных'
                },
                {
                    id: 6,
                    name: 'Английский язык'
                }
            ],
            personalQualities: [
                {
                    id: 1,
                    name: 'Внимательность'
                },
                {
                    id: 2,
                    name: 'Коммуникабельность'
                },
                {
                    id: 3,
                    name: 'Усидчивость'
                },
                {
                    id: 4,
                    name: 'Проактивность'
                },
                {
                    id: 5,
                    name: 'Исполнительность'
                },
                {
                    id: 6,
                    name: 'Способность к обучению'
                },
                {
                    id: 7,
                    name: 'Мобильность'
                },
                {
                    id: 8,
                    name: 'Ответственность'
                },
                {
                    id: 9,
                    name: 'Работоспособность'
                },
                {
                    id: 10,
                    name: 'Самостоятельность'
                },
                {
                    id: 11,
                    name: 'Стрессоустойчивость'
                },
                {
                    id: 12,
                    name: 'Умение работать в команде'
                },
                {
                    id: 13,
                    name: 'Аналитическое мышление'
                },
                {
                    id: 14,
                    name: 'Адаптивность'
                },
                {
                    id: 15,
                    name: 'Креативность'
                },
                {
                    id: 16,
                    name: 'Аккуратность'
                },
                {
                    id: 17,
                    name: 'Концентрация'
                }
            ]
        },
        {
            id: 2,
            name: 'Финансы',
            skills: [
                {
                    id: 18,
                    name: 'Математика'
                },
                {
                    id: 19,
                    name: 'Логика'
                },
                {
                    id: 20,
                    name: 'Логистика'
                },
                {
                    id: 21,
                    name: 'Оператор ЭВМ'
                },
                {
                    id: 22,
                    name: 'Знание excel'
                },
                {
                    id: 23,
                    name: 'Знание word'
                },
                {
                    id: 24,
                    name: 'Поиск информации в интернете'
                }
    
            ],
            professionalQualities: [
                {
                    id: 7,
                    name: 'Может в уме считать 2+2',
                },
                {
                    id: 8,
                    name: 'Складывать и умножать с калькулятором'
                },
                {
                    id: 9,
                    name: 'Несколько логарифмических уравнений в багаже'
                }
            ],
            personalQualities: [
                {
                    id: 60,
                    name: 'Терпеливость'
                   },
                   {
                    id: 61,
                    name: 'Уверенность в себе'
                   },
                   {
                    id: 12,
                    name: 'Умение работать в команде'
                   },
                   {
                    id: 63,
                    name: 'Уравновешенность'
                   },
                   {
                    id: 64,
                    name: 'Усидчивость'
                   },
                   {
                    id: 65,
                    name: 'Целеустремленость'
                   },
                   {
                    id: 66,
                    name: 'Честность'
                   },
                   {
                    id: 67,
                    name: 'Чувство юмора'
                   },
                   {
                    id: 68,
                    name: 'Эмоциональность '
                   },
                   {
                    id: 69,
                    name: 'Энергичность'
                   },
                   {
                    id: 70,
                    name: 'Энтузиазм'
                   },
                   {
                    id: 71,
                    name: 'Этичность'
                   }
            ]
        },
    ],
    personalQualities: [
            {
            id: 14,
            name: 'Адаптивность'
            },
            {id: 16,
            name: 'Аккуратность'
            },
            {
            id: 18,
            name: 'Активность'
            },
            {id: 19,
            name: 'Амбициозность'
            },
            {
            id: 13,
            name: 'Аналитическое мышление'
            },
            {
            id: 20,
            name: 'Бесконфликтность'
           },
           {
            id: 21,
            name: 'Быстрая реакция'
           },
           {
            id: 22,
            name: 'Вежливость'
           },
           {
            id: 1,
            name: 'Внимательность'
           },
           {
            id: 24,
            name: 'Гиперактивность'
           },
           {
            id: 25,
            name: 'Дисциплинированность'
           },
           {
            id: 26,
            name: 'Жадность'
           },
           {
            id: 27,
            name: 'Инициативность'
           },
           {
            id: 5,            
            name: 'Исполнительность'
           },
           {
            id: 2,            
            name: 'Коммуникабельность'
           },
           { 
            id: 17,          
            name: 'Концентрация'
           },
           {
            id: 15,
            name: 'Креативность'
           },
           {
            id: 32,
            name: 'Лояльность'
           },
           {
            id: 33,
            name: 'Максимализм'
           },
           {
            id: 7,
            name: 'Мобильность'
           },
           {
            id: 35,
            name: 'Мстительность'
           },
           {
            id: 36,
            name: 'Наглость'
           },
           {
            id: 37,
            name: 'Найстойчивость'
           },
           {
            id: 38,
            name: 'Находчивость'
           },
           {
            id: 39,
            name: 'Нездоровая лень'
           },
           {
            id: 40,
            name: 'Неумение работать в команде'
           },
           {
            id: 41,
            name: 'Неусидчивость'
           },
           {
            id: 42,
            name: 'Обидчивость'
           },
           {
            id: 43,
            name: 'Обяние'
           },
           {
            id: 44,
            name: 'Организованность'
           },
           {
            id: 8,
            name: 'Ответственность'
           },
           {
            id: 46,
            name: 'Порядочность'
           },
           {
            id: 47,
            name: 'Преданноствь'
           },
           {
            id: 48,
            name: 'Преданность'
           },
           {
            id: 49,
            name: 'Принципиальность'
           },
           {
            id: 4,
            name: 'Проактивность'
           },
           {
            id: 9,
            name: 'Работоспособность'
           },
           {
            id: 52,
            name: 'Решительность'
           },
           {
            id: 53,
            name: 'Самоконтроль'
           },
           {
            id: 54,
            name: 'Самокритичность'
           },
           {
            id: 10,
            name: 'Самостоятельность'
           },
           {
            id: 56,
            name: 'Скромность'
           },
           {
            id: 57,
            name: 'Слабая коммуникабельность'
           },
           {
            id: 6,
            name: 'Способность к обучению'
           },
           {
            id: 11,
            name: 'Стрессоустойчивость'
           },
           {
            id: 59,
            name: 'Тактичность'
           },
           {
            id: 60,
            name: 'Терпеливость'
           },
           {
            id: 61,
            name: 'Уверенность в себе'
           },
           {
            id: 12,
            name: 'Умение работать в команде'
           },
           {
            id: 63,
            name: 'Уравновешенность'
           },
           {
            id: 64,
            name: 'Усидчивость'
           },
           {
            id: 65,
            name: 'Целеустремленость'
           },
           {
            id: 66,
            name: 'Честность'
           },
           {
            id: 67,
            name: 'Чувство юмора'
           },
           {
            id: 68,
            name: 'Эмоциональность '
           },
           {
            id: 69,
            name: 'Энергичность'
           },
           {
            id: 70,
            name: 'Энтузиазм'
           },
           {
            id: 71,
            name: 'Этичность'
           }
        
    ]
}

const industries = [
    {
        id: 1,
        name: 'it-технологии'
    },
    {
        id: 2,
        name: 'Финансы'
    }
]